tap 'homebrew/cask'
tap 'koekeishiya/formulae'
tap 'shopify/shopify'
tap 'facebook/fb'

brew 'romkatv/powerlevel10k/powerlevel10k'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'zsh-vi-mode'
brew 'cocoapods'
brew 'ejson'
brew 'fzf'
brew 'git'
brew 'idb-companion'
brew 'imagemagick'
brew 'jq'
brew 'mas'
brew 'mitmproxy'
brew 'neovim'
brew 'node'
brew 'rbenv'
brew 'shellcheck'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'yabai'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask 'linearmouse'
cask '1password'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'caffeine'
cask 'daisydisk'
cask 'discord'
cask 'figma'
cask 'firefox'
cask 'flipper'
cask 'google-chrome'
cask 'iterm2'
cask 'kindavim'
cask 'messenger'
cask 'obsidian'
cask 'plex'
cask 'raycast'
cask 'react-native-debugger'
cask 'rectangle'
cask 'shottr'
cask 'signal'
cask 'spotify'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'
cask 'vlc'

mas '1Password for Safari', id: 1_569_813_296
mas 'AdBlock for Safari', id: 1_402_042_596
mas 'Xcode', id: 497_799_835
