tap 'homebrew/cask'
tap 'shopify/shopify'

brew 'cocoapods'
brew 'ejson'
brew 'fzf'
brew 'git'
brew 'imagemagick'
brew 'jq'
brew 'mas'
brew 'mitmproxy'
brew 'neovim'
brew 'node'
brew 'rbenv'
brew 'shellcheck'
brew 'vim'
brew 'wget'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask '1password'
cask 'appcleaner'
cask 'caffeine'
cask 'firefox'
cask 'flipper'
cask 'iterm2'
cask 'obsidian'
cask 'plex'
cask 'raycast'
cask 'react-native-debugger'
cask 'rectangle'
cask 'signal'
cask 'spotify'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

mas 'Xcode', id: 497799835
mas '1Password for Safari', id: 1569813296
