# frozen_string_literal: true

tap 'facebook/fb'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'koekeishiya/formulae'
tap 'promptops/promptops'
tap 'romkatv/powerlevel10k'
tap 'shopify/shopify'

brew 'bundletool'
brew 'cocoapods'
brew 'facebook/fb/idb-companion'
brew 'fzf'
brew 'git'
brew 'imagemagick'
brew 'jq'
brew 'mas'
brew 'mitmproxy'
brew 'neovim'
brew 'node'
brew 'postgresql@15'
brew 'rbenv'
brew 'romkatv/powerlevel10k/powerlevel10k'
brew 'shellcheck'
brew 'shopify/shopify/ejson'
brew 'the_silver_searcher'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'zsh-vi-mode'

cask '1password'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'caffeine'
cask 'cyberduck'
cask 'daisydisk'
cask 'discord'
cask 'figma'
cask 'firefox'
cask 'flipper'
cask 'google-chrome'
cask 'iterm2'
cask 'jellyfin'
cask 'karabiner-elements'
cask 'kindavim'
cask 'linearmouse'
cask 'messenger'
cask 'obsidian'
cask 'plex'
cask 'raycast'
cask 'react-native-debugger'
cask 'rectangle'
cask 'shottr'
cask 'signal'
cask 'spotify'
cask 'stats'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

mas '1Password for Safari', id: 1_569_813_296
mas 'KakaoTalk', id: 869_223_134
mas 'TestFlight', id: 899_247_664
mas 'Transporter', id: 1_450_874_784
mas 'Twitter', id: 1_482_454_543
mas 'Vimari', id: 1_480_933_944
mas 'Xcode', id: 497_799_835

vscode '42Crunch.vscode-openapi'
vscode 'albert.TabOut'
vscode 'AntiAntiSepticeye.vscode-color-picker'
vscode 'arcanis.vscode-zipfs'
vscode 'Arjun.swagger-viewer'
vscode 'atian25.copy-syntax'
vscode 'bibhasdn.unique-lines'
vscode 'bierner.markdown-preview-github-styles'
vscode 'blanu.vscode-styled-jsx'
vscode 'bradlc.vscode-tailwindcss'
vscode 'ckolkman.vscode-postgres'
vscode 'csstools.postcss'
vscode 'dbaeumer.vscode-eslint'
vscode 'eamodio.gitlens'
vscode 'emeraldwalk.RunOnSave'
vscode 'emilast.LogFileHighlighter'
vscode 'Equinusocio.vsc-community-material-theme'
vscode 'equinusocio.vsc-material-theme-icons'
vscode 'Equinusocio.vsc-material-theme'
vscode 'esbenp.prettier-vscode'
vscode 'expo.vscode-expo-tools'
vscode 'flowtype.flow-for-vscode'
vscode 'foxundermoon.shell-format'
vscode 'GitHub.copilot'
vscode 'github.vscode-github-actions'
vscode 'GitHub.vscode-pull-request-github'
vscode 'GrapeCity.gc-excelviewer'
vscode 'GraphQL.vscode-graphql-syntax'
vscode 'GraphQL.vscode-graphql'
vscode 'hashicorp.terraform'
vscode 'humao.rest-client'
vscode 'iliazeus.vscode-ansi'
vscode 'jingkaizhao.vscode-redux-devtools'
vscode 'jock.svg'
vscode 'jprestidge.theme-material-theme'
vscode 'justusadam.language-haskell'
vscode 'Kasik96.swift'
vscode 'kisstkondoros.vscode-gutter-preview'
vscode 'llvm-vs-code-extensions.vscode-clangd'
vscode 'lottiefiles.vscode-lottie'
vscode 'mariomatheu.syntax-project-pbxproj'
vscode 'mathiasfrohlich.Kotlin'
vscode 'mechatroner.rainbow-csv'
vscode 'mikestead.dotenv'
vscode 'misogi.ruby-rubocop'
vscode 'mjmcloug.vscode-elixir'
vscode 'mohsen1.react-javascript-to-typescript-transform-vscode'
vscode 'ms-azuretools.vscode-docker'
vscode 'ms-kubernetes-tools.vscode-kubernetes-tools'
vscode 'ms-python.isort'
vscode 'ms-python.python'
vscode 'ms-vscode-remote.remote-containers'
vscode 'ms-vscode.cpptools'
vscode 'ms-vscode.Theme-MaterialKit'
vscode 'ms-vsliveshare.vsliveshare'
vscode 'msjsdiag.vscode-react-native'
vscode 'naumovs.color-highlight'
vscode 'Orta.vscode-jest'
vscode 'pflannery.vscode-versionlens'
vscode 'PKief.material-icon-theme'
vscode 'Prisma.prisma'
vscode 'rebornix.ruby'
vscode 'redhat.java'
vscode 'redhat.vscode-xml'
vscode 'redhat.vscode-yaml'
vscode 'rioj7.commandOnAllFiles'
vscode 'RobbOwen.synthwave-vscode'
vscode 'ryuta46.multi-command'
vscode 'sammkj.vscode-elixir-formatter'
vscode 'samuelcolvin.jinjahtml'
vscode 'shakram02.bash-beautify'
vscode 'sorbet.sorbet-vscode-extension'
vscode 'teabyii.ayu'
vscode 'Thog.vscode-asl'
vscode 'timonwong.shellcheck'
vscode 'Tyriar.sort-lines'
vscode 'UCL.haskelly'
vscode 'unifiedjs.vscode-mdx'
vscode 'VisualStudioExptTeam.intellicode-api-usage-examples'
vscode 'VisualStudioExptTeam.vscodeintellicode'
vscode 'vknabel.vscode-apple-swift-format'
vscode 'vscjava.vscode-gradle'
vscode 'vscjava.vscode-java-debug'
vscode 'vscjava.vscode-java-dependency'
vscode 'vscjava.vscode-java-pack'
vscode 'vscjava.vscode-java-test'
vscode 'vscjava.vscode-maven'
vscode 'vscodevim.vim'
vscode 'wayou.vscode-todo-highlight'
vscode 'wesbos.theme-cobalt2'
vscode 'whizkydee.material-palenight-theme'
vscode 'wingrunr21.vscode-ruby'
vscode 'xabikos.ReactSnippets'
vscode 'xaver.clang-format'
vscode 'zhuangtongfa.material-theme'
